<template>
    <div class="container">
        <!--成果及奖励-->
        <div class="header">
            <div class="header-title">
                <h2>成果及奖励</h2>
            </div>
            <div class="date">
                <!--2018-08-08-->
            </div>
        </div>
        <div class="artical">
            <pre>   主持科研项目获奖

        1 王霓虹 低温催化处理含油矿物质生产燃料油技术 黑龙江省科技进步一等奖
        2 王霓虹 林火数据库与辅助决策系统 黑龙江省科技进步二等奖
        3 王霓虹 基于 WEB 的森林防火智能决策支持系统 黑龙江省科技进步二等奖
        4 王霓虹 森林重大灾害防治专家系统 黑龙江省科技进步省部级二等奖
        5 王霓虹 面向数字林业应用软件技术的研究 黑龙江省高校科学技术一等奖、科技进步省部级二等奖
        6 王霓虹 绿化林带常见灾害远程专家咨询系统 黑龙江省科技进步省部级三等奖
        7 王霓虹 城市绿地生态环境规划决策支持系统的研建 哈尔滨市科学技术奖科技进步三等奖
        8 苏健民 智能电力监控系统 黑龙江省自然科学社会力量科学进步奖三等奖
        9 任洪娥 节子形状的 NDT 检测及视频处理技术 黑龙江省第七届自然科学技术成果三等奖
        10 任洪娥 适用于矩形图像的新二维映射图像加密算法 黑龙江省第十一届自然科学技术成果三等奖
        11 赵鹏 image-fusion-based active contour model 黑龙江省第十一届自然科学技术成果三等奖
        12 赵鹏 a novel area measurement scheme based on multiresolution dynamic contour黑龙江省第十一届自然科学技术成果三等奖
        13 赵鹏 Image restoration for interlaced scan CCD image with space- variant motion blurs 黑龙江省第十二届自然科学技术学术成果奖三等奖
        14 任洪娥 基于数学模拟理论的板材树种识别方法及实现 黑龙江省第十二届自然科学技术学术成果奖三等奖
        15 赵鹏 《机器视觉研究与发展》（著作） 哈尔滨市2012年度自然科学技术学术成果奖二等奖
        16 刘美玲 动态多文档文摘模型 黑龙江省第十三届自然科学技术学术成果奖三等奖
        17 景维鹏 List scheduling with QoS requirements on heterogeneous distributed systems 黑龙江省第十三届自然科学技术学术成果奖三等奖
        18 任洪娥 Study on wood drying based on neural network and expert system 黑龙江省第十三届自然科学技术学术成果奖三等奖
        19 王名扬 Development a case-based classifier for predicting highly cited papers 黑龙江省第十三届自然科学技术学术成果奖一等奖
        20 王霓虹 远程地面红外林火自动探测系统 省科技进步三等奖

        主持完成的科研项目

        1 哈尔滨市科技局科技攻关项目 绿化林带常见灾害远程专家咨询系统 王霓虹
        2 哈尔滨市科技攻关项目 城市绿地生态环境规划决策支持系统的研建 王霓虹
        3 黑龙江省基金项目 东北主要树种板材特征的纹理视频检索理论 王霓虹
        4 黑龙江省科技攻关重大项目 基于WEB的森林防火智能决策支持系统 王霓虹
        5 黑龙江省信息产业厅项目 水泥企业通用型MIS软件系统的研发与应用 王霓虹
        6 黑龙江省科技攻关项目 面向数字林业应用软件技术的研究 王霓虹
        7 黑龙江省科技攻关项目 面向数字林业应用软件关键技术的研究 王霓虹
        8 黑龙江省发展信息产业专向基金项目 森林重大灾害智能专家系统 王霓虹
        9 教育部直属高校聘请外籍教师重点项目 基于3S技术的森林资源数字化管理关键技术 王霓虹
        10 黑龙江省森工总局-横向课题 森工总局木材生产销售信息化管理系统软件 王霓虹
        11 黑龙江省基金项目 木材激光加工机理和木制品快速原型/零件制造的理论研究 任洪娥
        12 黑龙江省科技攻关项目 板材材种识别数控设备与工艺研究 任洪娥
        13 黑龙江省国际科技合作项目 汽车牌照自动识别系统的研究与开发 任洪娥
        14 国家“948”项目新型高强度人造板长条薄片刨花数控生产技术引进 任洪娥
        15 国家“十五”攻关 子专题 实木开榫计算机辅助制造技术（CAM）研究 任洪娥
        16 哈尔滨市基金（留学回国人员）项目 家具企业综合优化管理信息系统关键技术研究 岳琪
        17 黑龙江省基金项目 模拟退火法优化约束条件下家具套裁理论的研究 岳琪
        18 黑龙江省博士后资助基金项目 基于企业资源计划的家具企业综合优化系统研究 岳琪
        19 哈尔滨市基金项目 基于遗传算法的中密度纤维板（MDF）热压机模糊控制器的建模与仿真研究 刘亚秋
        20 黑龙江省科技攻关项目 智能电力监控系统 苏健民
        21 黑龙江省科技攻关项目 动画智能支撑系统 邱兆文
        22 黑龙江省青年基金项目 多媒体信息的综合检索与智能处理技术研究 邱兆文
        23 黑龙江省科技攻关项目 重油轻质化化学添加剂优化配方计算机仿真实验系统研发 王阿川
        24 哈尔滨市基金项目 基于多Agent结构的分布式英语及汉语语块识别技术研究 梁颖红
        25 863计划 森林经营可持续生产决策支持技术 王霓虹
        26 国家林业局推广 数字林业综合软件技术与应用 王霓虹
        27 国家林业局林业公益性行业专项 基于物联网的监测技术及其在林业上的应用研究 王霓虹
        28 国家林业局林业公益性行业专项 竹材自动去青去黄提质增效工艺与技术开发 任洪娥
        29 教育部博导类 漆酶活化木质材料模压成材胶合机理研究 陈广胜
        30 留学基金 基于混沌理论的视频加密方法研究 张健
        31 留学基金 基于TRIZ的矛盾分析模型和专利优先权网络建立研究 于慧伶
        32 留学基金 个性化web图像检索技术研究 邱兆文
        33 优秀学科带头人 木材超细粉碎气流分选建模与计算机目数识别 任洪娥
        34 留学回国人员 动画智能制作技术研究 邱兆文</pre>
        </div>
    </div>
</template>

<script>
    export default {
        name: "Lnjj"
    }
</script>

<style scoped lang="scss">
    .container{
        background-color: #fff;
        margin: 2rem 0;
        padding: 0 5rem 5rem 5rem;

    .header{
        padding: 2rem 0 1rem 0;

    &-title{
         text-align: center;
         border-bottom: 1px solid #1a6840;
     }
    .date{
        margin-top: 1rem;
    }
    }
    .artical{
        margin: 0 5rem;
        text-align: left;
        line-height: 3rem;
    }
    }
</style>