<template>
    <div class="container">
        <!--专业简介-->
        <div class="header">
            <div class="header-title">
                <h2>计算机科学与技术</h2>
            </div>
            <div class="date">
                <!--2018-08-08-->
            </div>
        </div>
        <div class="artical">
            <pre>   计算机科学与技术系始建于1988年的微机应用专业。1995年在原专业基础上建立了“计算机科学与技术系”。2000年申报成功了“计算机应用技术”硕士点。“十一五”期间计算机专业被批准为黑龙江省重点专业建设点和东北林业大学优势专业，2011年通过了省教育厅专家组对省重点专业的验收工作。同年又再次被批准为黑龙江省“十二五”重点专业建设点。2015年计算机科学与技术专业成为教育部专业综合改革试点专业。
        计算机科学与技术系现有教师29人，其中教授6人，副教授12人，讲师11人。专任教师具有博士学位者19人，在读博士3人，博士生导师5人，硕士生导师11人，具有国外留学或访学经历的教师4人。
        过硬的政治素养，良好的师德师风是计算机专业人才培养质量的根本保证。专任教师中，拥有共产党员20人，近3年有2名教师荣获“黑龙江省高校师德先进个人”荣誉称号。
        较高的科学研究水平，充足的研究条件是计算机专业人才培养层次的基本保障。目前计算机系教师共承担国家自然科学基金、林业行业专项等各级各类科研项目60余项，总经费达2000余万元，累计发表论文500余篇，SCI/EI收录200余篇，获发明专利等知识产权20余项；获各类科研奖励30项。计算机系已形成了人工智能与信息系统、图形图像与多媒体技术、网络与信息安全、大数据与云计算、3S技术与数字林业等相对稳定的研究方向。
        完整的课程体系，高质量的课程建设是计算机专业人才培养质量的有力条件。计算机科学与技术专业主干课程有高级语言程序设计、算法设计与分析、数据结构、数字逻辑、计算机组成原理、操作系统原理、编译原理、数据库系统原理、软件工程、计算机网络、高性能与云计算。其中，8门课程为校级精品课和重点课程，每门课程均由3名以上教师构成的教学团队授课。
        充足的课外学习空间，丰富的课外训练活动是计算机专业拔尖人才培养的摇篮。目前建有总面积300余平米的2个大学生创新实验室，学生在ACM国际大学生程序设计大赛、机器人足球大赛、H3C杯全国大学生网络技术大赛等国际国内赛事上屡获佳绩。近五年获国家级学生科技竞赛奖30项；省级学生科技竞赛获奖数117项，教育部大学生创新训练项目40余项。
        经过近30年的不断发展建设，计算机系已具有较大的办学规模、鲜明的办学特色、明确的办学思想与办学理念，较强的办学实力，建立了完整的人才培养体系。已培养研究生120多人、本科生1400多人，专科生500多人。
        目前本专业限招理工类英语考生，学制4年，授予工学学士学位，每年招生量在180人左右，毕业生主要在科研院所、IT企业从事计算机软硬件开发、移动互联网开发等工作。近3年本专业毕业生约有1/3被保送或考取硕士研究生，1/5的学生进入阿里巴巴、搜狐、百度、用友等大型IT企业工作，学生就业年薪最高达24.5万元。
            </pre>
            <h4>计算机科学与技术专业培养目标</h4>
            <pre>

        本专业培养适应国家建设发展需要，德、智、体全面发展，具有良好的科学素养和丰厚的人文底蕴，掌握计算机科学与技术领域基本理论、基本技术和专业知识，能在计算机相关领域从事科学研究、工程实践开发和应用服务等工作，成为所在单位相关领域的技术或管理人才。
        毕业生经过5年左右的工程实践，具备以下能力：
        1、具有较强的实践能力，掌握计算机科学与技术核心基础理论知识和主流工程技术，熟练运用现代工具，能够承担计算机软硬件系统设计、开发、管理与应用等相关工作；
        2、具备一定的独立研究能力和自主学习意识，了解计算机相关技术发展前沿并能够结合数学和相关自然科学知识决策、分析、解决学科交叉背景下的复杂工程问题；
        3、具备良好的国际视野、较强的团队合作和沟通交流能力，能在学科融合和跨文化背景下很好地完成团队赋予的职责；
        4、恪守工程职业道德、遵守法律和职业规范，并且具有较强的人文关怀精神与社会服务意识，能够在工程项目的组织和实施中综合考虑经济、环境、安全、健康、伦理等因素。
            </pre>
            <h4>计算机科学与技术专业毕业要求</h4>
            <pre>

        1.职业规范：具有人文社会科学素养、社会责任感，能够在计算机相关工程实践中理解并遵守工程职业道德和规范，履行责任。
        1.1热爱祖国，理解社会主义核心价值观，身心健康。坚持道德上正确的主张、坚持实践正义原则、愿为他人和社会做出奉献，在实际问题中体现正确价值观；
        1.2理解计算机职业道德和规范的核心理念，在计算机软硬件研发、应用、管理和科研实践中坚守职业操守，兢兢业业做好本职工作，具有人文科学知识、人文素养、艺术修养和欣赏品味。
        2.社会与可持续发展：理解国家宏观发展相关产业政策和法律法规，正确认识和评价计算机相关工程实践和计算机相关复杂工程问题对环境、社会、健康、安全以及文化的影响，保持其与社会、环境的和谐可持续发展, 并理解应承担的责任。
        2.1理解社会、安全、健康、伦理、法律等方面的基本知识，具有计算机相关工程实习和社会实践的经历；
        2.2能在解决计算机相关复杂工程问题的过程中，从人文与社会、健康与安全、伦理与法律等方面进行分析、比较与评价，能够体现应尽义务、操守与责任；
        2.3理解环境与可持续发展的内涵和意义，能够理解计算机相关应用对社会环境与自然环境，以及可持续发展的影响与重要性；
        2.4理解复杂工程问题和任何工程实践都有可能对环境与可持续发展产生影响，针对具体问题的解决方案能够进行环境与可持续发展影响方面的分析与评价。
        3.工程知识与问题分析：具备数学、自然科学、工程科学基本原理和计算机科学与技术专业知识，用于识别、表述、并通过对文献的分析与研究计算机相关复杂工程问题，以获得有效结论。
          3.1 掌握数学、自然科学、工程基础和工程科学基本原理和专业知识，包括基本概念和分析方法；
          3.2能将数学、自然科学、工程基础和工程科学基本原理和计算机科学与技术专业知识对计算机相关复杂工程问题进行抽象、提取、归纳；
          3.3能够运用数学、自然科学、计算机科学与技术的基本理论与方法，对计算机相关复杂工程问题进行表述和分析，并能综合运用文献检索及现代信息技术，以获得有效结论；
          3.4能应用数学、自然科学、计算机科学与技术的基本理论与方法对计算机相关复杂工程问题进行推理与验证等，并获取有效结论，同时应具备创新意识、批判性思维，试图改进计算机相关复杂工程问题求解方法。
        4.设计研究：能够设计出满足特定需求的系统或针对计算机相关复杂工程问题的解决方案，并在设计环节中体现创新意识，考虑社会、健康、安全、法律、文化以及环境等因素；能够基于科学原理并采用科学方法对计算机相关复杂工程问题进行研究，包括设计实验、分析与解释数据、并通过信息综合得到合理有效的结论。
          4.1掌握计算机相关工程问题的基本设计原理与方法，能够针对计算机相关复杂工程问题设计合理的解决方案，并能够根据不同用户需求确定相应设计目标，提出问题的解决方法，其中应体现出一定的创新思维能力；
          4.2具有综合运用理论和技术手段设计计算机相关复杂工程问题的能力，设计过程中能够综合考虑经济、环境、法律、安全、健康、伦理等制约因素；
          4.3针对计算机相关复杂工程问题能够运用计算机技术及相关的理论与方法建立实验方案，并能够掌握原始数据收集与处理方法、参数分析方法、实验结果检验方法与综合分析方法；
          4.4能够在课程实验、实习实践、大学生创新竞赛、毕业设计（论文）等实践环节中，研究与设计计算机相关复杂工程问题的解决方案，呈现设计或研究成果。
        5.项目管理：能够理解并掌握计算机相关工程实践的管理原理与经济决策方法，并能在多学科环境中应用。
          5.1理解技术方案的经济分析与决策方法等知识，并对当前计算机相关产业有一定的认识；
          5.2能运用系统工程的观点、理论和方法，对项目涉及的相关工作进行管理，并应用于多学科环境中复杂工程问题的解决。
        6.现代工具：能够针对计算机相关复杂工程问题，开发、选择与使用恰当的技术、资源、现代工程工具和信息技术工具，包括对计算机相关复杂工程问题的预测与模拟，并能够理解其局限性；对解决方案及结果评估优化，体现创新能力。
          6.1能够熟练运用程序设计方法、环境与工具，包括软件集成开发环境，实验数据分析工具，模拟与仿真工具，软件测试工具等；
          6.2能够熟练掌握计算机系统的应用环境与开发工具，包括数据库系统环境与工具、操作系统与编译系统、计算机网络环境与互联网平台等；
          6.3能够选择与运用计算机科学与技术的方法、环境与工具，针对计算机相关复杂工程问题的解决方案，进行分析与比较、预测与模拟，并能够理解解决方案的局限性。
        7.个人与团队：在多学科背景下的团队中具有一定的组织管理能力和团队协作能力，理解个体、团队成员以及负责人的角色，承担起自己的责任，发挥相应的作用。
          7.1能主动与本学科及其他学科的成员开展合作，理解个人、团队、社会的关系，理解个人和团队的利益统一性；
          7.2应能承担多学科背景下团队中不同角色的职责，能倾听其他团队成员的意见，具备团队组织协调能力。
        8.表达沟通：能够就计算机相关复杂工程问题与业界同行及公众进行有效沟通和交流，包括撰写报告、陈述发言、清晰表达等，能够在跨文化背景下进行沟通和交流，具备一定的国际视野。
          8.1应具有计算机相关外语文献检索与阅读能力，具有专业外语交流能力，能够在跨文化背景下进行沟通和交流，具备一定的国际视野；
          8.2应能够在各种教学和实践环节中，针对计算机相关复杂工程问题解决方案与同学、同行及公众进行有效沟通和交流，包括撰写报告和设计文稿、陈述发言、清晰表达观点，准确回应提问等。
        9.终身学习：具有较强的自主学习和终身学习的意识，具有在科学研究与技术应用过程中不断学习和适应发展的能力。
          9.1学生应能够理解自主学习和终身学习的重要性与必要性，掌握一定的自主学习和终身学习的方法，养成阅读习惯，具备适应社会发展的能力；
          9.2学生具备自我管理能力，能科学有效的管理时间，具备时间观念，制定并执行时间规划表。</pre>
        </div>
    </div>
</template>

<script>
    export default {
        name: "Cs"
    }
</script>

<style scoped lang="scss">
    .container{
        background-color: #fff;
        margin: 2rem 0;
        padding: 0 5rem 5rem 5rem;

        .header{
            padding: 2rem 0 1rem 0;

            &-title{
                 text-align: center;
                 border-bottom: 1px solid #1a6840;
             }
            .date{
                /*float: right;*/
                margin-top: 1rem;
            }
        }
        .artical{
            margin: 0 5rem;
            text-align: left;
            line-height: 3rem;
        }
    }

</style>