<template>
    <div class="container">
        <!--专业简介-->
        <div class="header">
            <div class="header-title">
                <h2>信息管理与信息系统</h2>
            </div>
            <div class="date">
                <!--2018-08-08-->
            </div>
        </div>
        <div class="artical">
            <pre>   信息管理与信息系统专业于2000年设立，属于管理科学与工程学科，同年9月开始招生；2002-2013年同时招收中外合作办学项目生。2014年成功申报“管理科学与工程”二级硕士授权点，本科专业代码为110102。目前信息管理与信息系统专业每年招收本科生100人左右，截止到2015年已毕业学生11届，共计1196人，目前在校本科生384人、研究生21人。
        经过近16年的建设发展，专业已形成明确的办学思想与办学理念，具有一定的办学规模、鲜明的办学特色并具备较强的办学实力。建立了一支团结协作、学术梯队完整、结构合理、科研能力强、教学水平高、后备力量强的教师队伍。到目前为止，信管专业有专任教师12人，其中教授1人，副教授6人，讲师5人；具有博士学位6人，具有硕士学位11人，其中在读博士3人，硕士生导师3人。
        近五年来，专业教师承担国家、省部级各类科研项目19项，其中国家级课题3项，省部级项目4项，校级立项课题16项；各类项目总经费中主持纵向125.3万元，核心以上论文55篇，其中SCI/EI收录34篇，获省部级奖励4项。
        经过多年的建设和发展，信管专业形成了独特的优势和特色：
        （1）教育教学理念先进，专业建设目标明确
        专业秉承学校“以林业为优势、以林业工程为特色 ”的定位，确立了“成为省内领先 、国内同类院校中具有影响的特色专业”的目标，以期充分发挥产学研一体化优势，通过需求牵引和科研先导，在信息系统开发与建模、电子商务决策与应用 、商务智能与大数据分析等方面形成特色，形成以培养既掌握领域前沿知识又具有较强实践能力和创新能力的复合型专门人才为目标的专业建设理念。
        （2）教育模式上逐步形成“以社会和企业需求为引导，以开放融合为特征”具有国际视野的复合型人才培养机制。
        从2009年开始专业通过与俄罗斯符拉迪沃斯托克国立经济与服务大学的合作办学，不断吸纳了国外优秀的教学内容、教学方式、教学方法，充分利用国外优质教育资源，推动了学校教育教学改革。
        专业还率先实施了校企无缝连接的多元化“3+1”创新人才培养模式及学分置换机制，与国内众多知名IT企业建立了合作关系，培养了符合产业要求“零适应期”优秀学生。
        （3）积极推荐教学改革，不断探索“以专业能力设计为主导，以创新创业能力为特点”的教学体系。
        本专业以转变教育思想、更新教育观念为先导，实施全面素质教育为根本，拓宽专业口径、优化培养计划为主线，积极推进专业教学内容、教学方法与课程体系改革。学校所倡导的考试改革已经全面推行，夯实了学生的理论基础。
        在创新创业能力培养方面，以管理学科和计算机学科相融合为契机，从课程体系设置入手，从实践体系支撑，各级创新项目成果显著，创业成功案例不断涌现，在各级管理决策和科技技能大赛中也硕果累累。
        （4）高质量就业，具示范作用
        信息管理与信息系统专业在人才培养过程中，紧密结合国家产业需求及行业特色，密切与行业企业合作进行人才培养，近年来一直保持着学生就业高质量，并出现不断攀升的良好局面。以2011级毕业生为例，在因全球经济依然不景气等客观因素影响的被称为“史上最难就业季”的2015年，专业2011级2班公务员考取率创下历史新高，2011级1班27名同学，以平均年薪10万元的薪资全部实现就业，其中有9名同学被985、211高校录取读研，在网上一度被冠以“东林史上最牛毕业班”的称呼，众多知名媒体给予了重点关注和报道。
        高质量就业为专业人才培养提供了良好的示范作用，进一步紧密了专业人才培养与行业优质企业的合作关系，毕业生受到了用人单位的欢迎和好评。
        （5）学科建设取得显著效果，科研实力明显增强
        专业建设过程中，不断突出学科建设的龙头地位，以硕士点申报、科研团队建设为抓手，着力提升科研学术水平，凝练出了“管理信息系统与商务智能”、“数据科学与决策支持”、“管理优化与复杂性科学”等特色鲜明的科研方向，在国家级科研项目等方面取得一批高水平、标志性成果。近五年来，主持承担了国家自然科学基金项目3项，资助经费近90万元，在生物信息学领域国际顶级期刊“bioinformatics”（影响因子为5.432）、信息科学领域国际顶级期刊“Journal Of”等刊物中发表SCI检索论文共11篇，并于2014年成功申报“管理科学与工程”二级硕士授权点，2015年成功迎来硕士点第一批硕士研究生。
        近年来，随着全球信息化和网络化时代的到来，以及各国对高层次信息服务和信息人才需求的增加，信管专业的发展已进入到需要进一步适应国际社会信息化的大环境，培养具有突出实践能力和创新意识的信息管理专门人才的新阶段。</pre>
        </div>
    </div>
</template>

<script>
    export default {
        name: "Xxgl"
    }
</script>

<style scoped lang="scss">
    .container{
        background-color: #fff;
        margin: 2rem 0;
        padding: 0 5rem 5rem 5rem;

        .header{
            padding: 2rem 0 1rem 0;

            &-title{
                 text-align: center;
                 border-bottom: 1px solid #1a6840;
             }
            .date{
                /*float: right;*/
                margin-top: 1rem;
            }
        }
        .artical{
            margin: 0 5rem;
            text-align: left;
            line-height: 3rem;
        }
    }
</style>