<template>
    <div class="container">
        <el-table
                :data="tableData"
                size="medium"
                stripe
                max-height="300"
                fit
                style="width: 100%"
        >
            <el-table-column
                    height=""
                    prop="date"
                    label="公告"
                    align="center"
                    width="100px">
            </el-table-column>
            <el-table-column
                    prop="title"
                    show-overflow-tooltip
            >
            </el-table-column>
            <el-table-column
                    width="100px"
            >
                <template slot-scope="scope">
                    <el-button
                            size="mini"
                            @click="handleEdit(scope.$index, scope.row)">查看 >></el-button>
                </template>
            </el-table-column>
        </el-table>
    </div>

</template>

<script>
    export default {
        name: "Notice",
        data() {
            return {
                tableData: [
                    {
                        date: '05-02',
                        title: '信息学院举办网络安全科普报告会',
                        content: '题目：网络安全就在你我身边\n' +
                        '\n' +
                        '主讲：张勇 国内知名网络安全企业安天科技资深网络安全工程师黑龙江省网信办、工信委咨询专家，网络攻防技术对抗一线优秀青年研究者，GeekPwn现场智能手机APP程序破解者。\n' +
                        '\n' +
                        '时间：2018年5月29日（星期二）18:00-20:00\n' +
                        '\n' +
                        '地点：丹青楼319\n' +
                        '\n' +
                        '主讲内容：“没有网络安全就没有国家安全”是习总书记在当今网络强国时代发出的历史强音。十年前，黑客攻击、病毒武器、窃取机密，网络安全较量的刀光剑影似乎离同学们很远。然而，2017年一场勒索病毒WannaCry的大范围爆发把我们拉回到了现实——在互联网时代，无论你身在何方，只要处于网络之中，都不可避免地面临着网络安全威胁。钓鱼网站，游戏盗号，虚假二维码，恶意黑Wifi，形形色色的网络安全威胁该如何应对？学院特邀请国内一线知名网络安全企业开展提高同学们网络安全防护意识和技能的讲座。\n' +
                        '\n' +
                        '诚挚邀请广大师生光临并参与交流！\n' +
                        '\n' +
                        '\n',
                        publisher:'信息学院软件工程专业'
                    }, {
                        date: '05-02',
                        title: '黑龙江省第二届精准医疗及3D打印技术研讨会',
                        content: '主办单位：CCF  YOCSEF哈尔滨、黑龙江省3D打印产业联盟\n' +
                        '\n' +
                        '承办单位：东北林业大学信息学院\n' +
                        '\n' +
                        '赞助企业：黑龙江拓盟科技有限公司\n' +
                        '\n' +
                        '时间：2016年11月27日(13:30-17:30)\n' +
                        '\n' +
                        '地点：东北林业大学成栋楼1016学术报告厅\n' +
                        '\n' +
                        '本次报告会将介绍三维重建和3D打印技术在精准医疗中的应用。利用计算机图像处理与3D打印技术，将断层扫描数据转化为三维模型，进而通过3D打印技术生成实体模型，用于医患沟通、病情诊断、手术规划、术后评估等场合。\n' +
                        '\n' +
                        '特邀讲者：李志强  博士  北京儿童医院心脏外科  主任医师\n' +
                        '\n' +
                        '报告题目：三维重建技术在复杂先心病手术中的应用\n' +
                        '\n' +
                        '讲者介绍：男，1973年11月出生，满族，中共党员。医学博士，主任医师，现任首都医科大学附属北京儿童医院心脏外科副主任。2003年于中国协和医科大学外科学（胸心外科）博士研究生毕业，获医学博士学位，师从中国著名心血管外科专家朱晓东院士。第三届北京医学会心脏外科分会委员。第七届北京医学会小儿外科分会委员 。\n' +
                        '\n' +
                        '工作经历：\n' +
                        '\n' +
                        '2003.07-2010.03   中国医学科学院阜外心血管病医院心血管外科     主治医师\n' +
                        '\n' +
                        '                                                               副主任医师\n' +
                        '\n' +
                        '2010.03-2016.03   首都医科大学附属北京安贞医院小儿心脏中心     副主任医师                                                                      主任医师\n' +
                        '\n' +
                        '2016.03-至今      首都医科大学附属北京儿童医院心脏外科         主任医师\n' +
                        '\n' +
                        '2014年获北京市卫生系统高层次卫生技术人才--学科骨干\n' +
                        '\n' +
                        '2015年6月-2015年11月参加美国德州医学中心professional training计划，分别前往Memorial Hermann Hospital、Texas Children’s Hospital、The Staten Island University Hospital，接受人工心脏、心脏移植、微创心脏外科手术和复杂先天性心脏病外科治疗的专科培训课程。\n' +
                        '\n' +
                        '2003年博士研究生毕业至今，从事心脏外科工作13年，独立完成心脏外科各类手术近5000例，包括冠状动脉旁路移植、瓣膜置换和各类先心病手术。近5年来，独立完成先心病手术2300余例，其中包括switch手术，Rastelli手术，全腔静脉肺动脉连接术，完全型心内膜垫缺损矫治术，完全型肺静脉畸形引流矫治术，肺动脉融合术等高难度手术，总体手术死亡率不足2%。手术级别以及手术治疗效果已达到国际先进水平。先后前往国内10余医院进行手术指导，帮助开展心脏外科手术，包括学术支持、技术指导和人员培训，获得一致好评。\n' +
                        '\n' +
                        '主持并参与多项国家级、省部级科研项目，包括863计划、国家自然科学基金项目等，在国内外核心期刊发表论文20余篇，其中5篇被SCI收录。积极开展先天性心脏病的三级防治工作，广泛建立先心病防治网络，填补我国目前一级防治空白，二级防治刚起步的现状。采用基因芯片技术开展先天性心脏病致病基因筛选的研究，筛查高危人群，高危孕妇，同时结合胎儿超声心动检查，对先心病患儿做到早发现、早诊断、早治疗，建立先心病救治的绿色通道，快速及时地对部分危重患儿实施手术治疗。\n' +
                        '\n' +
                        '特邀讲者：刁力为 博士 哈医大二院 主治医师\n' +
                        '\n' +
                        '报告题目：三维重建和3d打印技术在心血管外科的应用\n' +
                        '\n' +
                        '讲者介绍：男，1982年出生，哈医大二院心血管外科主治医师，医学博士，AME学术沙龙委员。哈尔滨医科大学临床医学七年制毕业，从事心血管外科一线工作10年，每年主刀或参与完成各类心血管外科手术200余例，掌握冠脉外科、瓣膜外科、先心外科、大血管外科等手术技术，曾赴美国休斯敦、澳大利亚墨尔本、韩国首尔等地学习，主持完成省部级、厅局级课题3项，参与完成国家级等各类重大课题5项，发表文章20余篇，大会发言10余次，参编或主译8部专业书，获省级医疗新技术应用奖3次，获哈医大优秀青年教师、优秀双语教学奖，中国医师会心血管外科会长孙立忠教授博士生。研究方向：心衰外科治疗、心脏移植供心保护、人工心脏研发与应用、纳米压电材料在医学中的应用、心脏外科微创治疗等。\n' +
                        '\n' +
                        '特邀讲者：郭艳玲 博士  哈尔滨自由智造有限公司 董事长\n' +
                        '\n' +
                        '报告题目：新型激光3D打印材料\n' +
                        '\n' +
                        '讲者介绍：教授，博士生导师。大连理工大学获学士学位，哈尔滨工业大学获硕士、博士学位，哈尔滨工业大学机械工程博士后流动站、华崴集团博士后工作站出站，美国密歇根大学Sam Wu先进制造技术中心访问学者。主持国家自然科学基金、“948”项目、省市项目等20余项，获省级一等奖1次，2等奖3次。发表论文150余篇，撰写专著3部，主编教材4本，获得国家发明专利、实用新型专利工18项。提出采用成本低廉、低碳环保的木塑材料作为激光增材制造原料的设想，并取得突破性成果，成为继金属基、无机非金属、高分子材料之后的第四类可持续性环保材料，获得了3项发明专利授权，成功地将农林业废弃物应用于先进制造技术中。\n' +
                        '\n' +
                        '特邀讲者：邱兆文  博士  黑龙江拓盟科技有限公司  董事长\n' +
                        '\n' +
                        '报告题目：拓盟医学影像处理系统在精准外科手术中的应用\n' +
                        '\n' +
                        '讲者介绍：博士，副教授。1999年至今在东北林业大学信息与计算机工程学院从事信息检索、机器学习、三维数字化等研究工作。东北林业大学三维数字化技术研究所所长。2009年获哈尔滨工业大学工学博士学位。2009年至2010年在美国卡内基梅隆大学做访问学者。主持参加国家自然科学基金、国家发改委产业化基金、国家工信部产业化基金、科技部科技人员服务企业专项基金、省科技攻关重点项目等17 项。获国家发明专利 3 项，软件著作权 4项。在国内外核心期刊发表学术论文 25 篇，主编教材 3 部，专著 1 部。荣获省科技进步三等奖 1 项，省高等教育教学成果奖二等奖 1 项，市科技进步一等奖 1 项。',
                        publisher:'信息学院软件工程专业'
                    }, {
                        date: '05-02',
                        title: '信息学院举办网络安全科普报告会',
                        content: '（1）复试考生报到及资格审查\n' +
                        '\n' +
                        '    时间:2018年4月11日(周三)上午8:30\n' +
                        '\n' +
                        '    地点:成栋楼1026办公室\n' +
                        '\n' +
                        '    联系人:刘欣\n' +
                        '\n' +
                        '    联系人电话:0451-82191521  \n' +
                        '\n' +
                        '（2）复试面试时间: 2018年4月11日(周三)上午9：00-10：00\n' +
                        '\n' +
                        '复试面试地点：\n' +
                        '\n' +
                        '    成栋楼1007教室\n' +
                        '\n' +
                        '（3）复试笔试时间：2018年4月11日(周一)上午10：00-12：00\n' +
                        '\n' +
                        '复试笔试地点：\n' +
                        '\n' +
                        '    成栋楼1007教室\n' +
                        '\n' +
                        ' \n' +
                        '\n' +
                        '    注意事项：复试之前对考生进行资格审查，条件以我校2018年硕士研究生招生简章的规定为准，除审查准考证、有效身份证件和政审表原件与复印件外，非应届本科生需提交学历证书、学位证书原件与复印件；应届本科生需提交学生证、成绩单原件和复印件，其毕业证书及学士学位证书将在入学时提交审查。各单位招生领导小组负责对考生资格进行审查。\n' +
                        '\n' +
                        '\n'
                    },{
                        date: '05-02',
                        title: '信息与计算机工程学院举行教学研讨报告会',
                        content: '报告题目：基于CDIO-OBE培养模式的一体化课程体系构建 ——以“计算机科学与技术专业”为例\n' +
                        '\n' +
                        '报 告 人：于津\n' +
                        '\n' +
                        '报告时间：2017年7月20日 (星期四) 下午2:00—4:00\n' +
                        '\n' +
                        '\n' +
                        '报告地点：成栋楼1014\n' +
                        '\n' +
                        '报告人简介：于津，汕头大学计算机系专业负责人，副教授。吉林大学计算机系学士、硕士。多年来潜心专注于教学和科研工作，对计算机科学与技术专业教育方式、方法的探究和实践取得了较好效果，获李嘉诚基金会颁发“卓越教学奖”。主要承担专业基础和研究生基础理论教学工作。个人的主要研究兴趣在人工智能、机器学习、数据挖掘、大数据等研究方向。\n' +
                        '\n' +
                        '汕头大学是我国第一批引入“CDIO—OBE工程教育模式理念”的高校之一，本次讲座将以 “计算机科学与技术专业”为例，介绍汕头大学“面向工程认证的CDIO—OBE工程教育模式”新成果，汕头大学将CDIO与OBE创新性的融通结合，取得良好的教学效果。\n' +
                        '\n' +
                        '相关链接：\n' +
                        '\n' +
                        'OBE是基于学习结果的工程教育模式。在理念上，OBE是一种“以学生为本”的教育哲学；在实践上，OBE是一种聚焦于学生受教育后获得什么能力和能够做什么的培养模式；在方法上，OBE要求一切教育活动、教育过程和课程设计都是围绕实现预期的学习结果来开展。实现OBE的关键一是确定培养目标，即学生毕业后达到的水平和特征；二是构建培养体系，展示培养结果反映学生的进步，实现培养目标；三是明确教学活动，界定学生要学什么，达到怎样的学习结果；四是提供各种教学评估策略，保证达到培养结果、满足学生的需要。其根本目标是建立以OBE为中心的工作路径，解决工作效率低下的问题。\n' +
                        '\n' +
                        'CDIO与OBE既存在形式上的融通，更存在精神上的融通。CDIO是以《CDIO能力大纲》所代表的“预期学习结果”集合来驱动课程内容、教学方法、教育文化等设计的模式，OBE是以“预期学习结果”来驱动整个教育结构的模式，两者在形式上是融通的。CDIO实施主动性教学方法，重视营造工程教育文化，OBE强调以生为本，注重教育软环境建设，加强师生互动，两者在精神上也是融通的。CDIO与OBE深层次的契合，源自于CDIO工程教育模式在产生与发展过程中受到了以学习结果为导向的工程教育认证与实践的影响。两者在特点上也存在不同，CDIO教育模式是由MIT等世界名校倡导和推广的工程教育理念，是培养学生到企业对产品进行构思、设计、实施和运作能力的工程教育模式；OBE教育模式是20世纪末兴起于美国的以成果为导向的教育模式，该模式以学生为中心，强调学习成果，倡导首先确定通过某一教育过程的学习应该取得什么样的教育成果，然后根据这一预设成果制订相关培养方案、教学方法和考评方式，学生在完成学习后应该展示他们掌握了相关知识和技能。CDIO是高校层面的合作组织，学校需加入CDIO合作组织，实现教学资源的共享；OBE则更注重的是国家层面的合作与互认。\n' +
                        '\n' +
                        '欢迎广大师生届时参加交流！',
                        publisher:'信息学院软件工程专业'
                    },{
                        date: '05-02',
                        title: '信息学院举办网络安全科普报告会',
                        content: '题目：网络安全就在你我身边\n' +
                        '\n' +
                        '主讲：张勇 国内知名网络安全企业安天科技资深网络安全工程师黑龙江省网信办、工信委咨询专家，网络攻防技术对抗一线优秀青年研究者，GeekPwn现场智能手机APP程序破解者。\n' +
                        '\n' +
                        '时间：2018年5月29日（星期二）18:00-20:00\n' +
                        '\n' +
                        '地点：丹青楼319\n' +
                        '\n' +
                        '主讲内容：“没有网络安全就没有国家安全”是习总书记在当今网络强国时代发出的历史强音。十年前，黑客攻击、病毒武器、窃取机密，网络安全较量的刀光剑影似乎离同学们很远。然而，2017年一场勒索病毒WannaCry的大范围爆发把我们拉回到了现实——在互联网时代，无论你身在何方，只要处于网络之中，都不可避免地面临着网络安全威胁。钓鱼网站，游戏盗号，虚假二维码，恶意黑Wifi，形形色色的网络安全威胁该如何应对？学院特邀请国内一线知名网络安全企业开展提高同学们网络安全防护意识和技能的讲座。\n' +
                        '\n' +
                        '诚挚邀请广大师生光临并参与交流！\n' +
                        '\n' +
                        '\n',
                        publisher:'信息学院软件工程专业'
                    }]
            }
        },
        methods:{
            handleEdit(index,row){
                console.log(index,row);
                this.$router.push({
                    path:'/notice',
                    query:{
                        id: index
                    }
                })
            },
        }
    }
</script>

<style scoped lang="scss">
.container{
    margin: 20px 20px 10px 0;
}
</style>